using System;

//task03
//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным.
int value = 11;
if (value % 2 == 0)
{
    Console.WriteLine("Число четное");
}
else
{
    Console.WriteLine("Число не четное");
}